Table of Contents
 Class Member
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Member identification
[Obfuscation(Feature = "renaming")]
public class Member
Inheritance
object
Member
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Member()
Constructor
public Member()
 Member(MemberType, int)
Constructor
public Member(MemberType memberType, int id)
Parameters
memberType MemberType
Type of member
id int
Id of member
Properties
 Id
Id of member
public int Id { get; set; }
Property Value
int
 MemberType
Type of member
public MemberType MemberType { get; set; }
Property Value
MemberType
 Edit this page